MAKELOG.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>MAKELOG</title>
<!-- 2016-12-24 Sat 09:38 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Skyler Layne" />
</head>
<body>
<div id="content">
<h1 class="title">MAKELOG</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Make Log</a>
<ul>
<li><a href="#sec-1-1">1.1. Angular 2</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. Started by generating a new components and models.</a></li>
<li><a href="#sec-1-1-2">1.1.2. Downloading 'Vendor Assets'</a></li>
<li><a href="#sec-1-1-3">1.1.3. Start Coding</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Make Log</h2>
<div class="outline-text-2" id="text-1">
<p>
or, the steps I took to produce this Frontend.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Angular 2</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Angular 2, not 1.x, because the component model is much better than some hacked vanilla ES4 crap.
You can read more about <a href="http://learnangular2.com/">Angular2 and Components</a>.
</p>
</div>

<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Started by generating a new components and models.</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">

<pre class="src src-bash">$ ng new student
$ ng generate component side-bar
$ ng generate component main
$ ng generate model mark
$ ng generate model course
$ ng generate service course
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Downloading 'Vendor Assets'</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Assests are <i>static</i> javascript, css, and font files. A vendor is someone who isn't you.
Vendor assets are statis css, js, and font files which will be used by the project.
</p>
</div>

<ol class="org-ol"><li><a id="sec-1-1-2-1" name="sec-1-1-2-1"></a>Vendor Asset Sources:<br  /><div class="outline-text-5" id="text-1-1-2-1">
<ul class="org-ul">
<li><a href="https://jquery.com/">JQuery</a>: A javascript UI library.
</li>
<li><a href="http://getbootstrap.com/">Bootstrap</a>: A css framework.
</li>
<li><a href="http://fontawesome.io/">Font Awesome</a>: Awesome icons.
</li>
<li><i>Photon Kit</i>: Another css framework.
</li>
</ul>
</div>
</li></ol>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> Start Coding</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
Angular2 uses the component model so which is essentually an MVC (model view controller), e.g. mark.ts is the model,
mark.component.html is the view, and mark.component.ts is the controller.
</p>
</div>

<ol class="org-ol"><li><a id="sec-1-1-3-1" name="sec-1-1-3-1"></a>Wrote the Models<br  /><div class="outline-text-5" id="text-1-1-3-1">
<p>
In each model (<a href="./src/app/models/course.ts">course</a>, <a href="./src/app/models/mark.ts">mark</a>) we have all the variables we need to model a domain specific Mark, and Course.
These models transition down into the properties of a database.
</p>
</div>
</li>

<li><a id="sec-1-1-3-2" name="sec-1-1-3-2"></a>Wrote the Components<br  /><div class="outline-text-5" id="text-1-1-3-2">
<p>
In the component we control the data for our templates, this is where we call out to our services to get/save data
from our view. We can also do some manipulations here like display error messages etc.
</p>
</div>
</li>

<li><a id="sec-1-1-3-3" name="sec-1-1-3-3"></a>Write the Templates<br  /><div class="outline-text-5" id="text-1-1-3-3">
<p>
Here we place <i>bindings</i> and interact with the component, to inject variables into the template we use mustaches
<code>{{ variableName }}</code> we can also add events to any HTML element. For example <code>(click), (keydown.enter), (focusout)</code>
were can call a function from the component; the templates are chalked full of these.
</p>
</div>
</li></ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Skyler Layne</p>
<p class="date">Created: 2016-12-24 Sat 09:38</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 26.0.50.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
